src/config/Catalogs/ДополнительныеПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>ДополнительныеПечатныеФормы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХранилищеВнешнейОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Принадлежность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СсылкаОбъекта</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/Catalogs/ДополнительныеПечатныеФормы/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
#Если Клиент Тогда
	Если ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст  = "ВЫБРАТЬ
	                |	1
	                |ИЗ
	                |	Справочник.ДополнительныеПечатныеФормы.Принадлежность КАК ЭтаФорма
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДополнительныеПечатныеФормы.Принадлежность КАК ОстальныеФормы
	                |		ПО ЭтаФорма.СсылкаОбъекта = ОстальныеФормы.СсылкаОбъекта
					|		И ЭтаФорма.Ссылка.Наименование = ОстальныеФормы.Ссылка.Наименование 
					|		И ЭтаФорма.Ссылка <> ОстальныеФормы.Ссылка
					|		И НЕ ОстальныеФормы.Ссылка.ПометкаУдаления
	                |ГДЕ
	                |	ЭтаФорма.Ссылка = &Ссылка";
					
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		Ответ = Вопрос("Для объектов, которым предназначена данная печатная форма, уже 
						|назначена другая форма с таким же именем. Рекомендуется изменить 
						|имя формы. Записать объект?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
#КонецЕсли
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ Отказ Тогда
	
		обЗаписатьПротоколИзменений(ЭтотОбъект);
	
	КонецЕсли; 

КонецПроцедуры
